000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PTABLE.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-ONED.
000600    05 WS-CHAR PIC A(2) OCCURS 5 TIMES.
000700 01 WS-TWOD.
000800    05 WS-FIRST OCCURS 3 TIMES.
000900       10 WS-A PIC A(1).
001000       10 WS-SECOND OCCURS 2 TIMES.
001100          15 WS-B PIC X.
001200 PROCEDURE DIVISION.
001300     MOVE 'AABBCCDDEE' TO WS-ONED.
001400     DISPLAY ' ONE DIMENSIONAL TABLE:'.
001500     DISPLAY ' FIRST ENTRY IN THE TABLE      : ' WS-CHAR(1).
001600     DISPLAY ' SECOND ENTRY IN THE TABLE     : ' WS-CHAR(2).
001700     DISPLAY ' THIRD ENTRY IN THE TABLE      : ' WS-CHAR(3).
001800     DISPLAY ' FOURTH ENTRY IN THE TABLE     : ' WS-CHAR(4).
001900     DISPLAY ' FIFTH ENTRY IN THE TABLE      : ' WS-CHAR(5).
001950************************************************************
002000     MOVE 'A12B34C56' TO WS-TWOD.
002100     DISPLAY ' TWO DIMENSIONAL TABLE:'.
002200     DISPLAY ' FIRST ENTRY IN THE TABLE   : ' WS-FIRST(1).
002220     DISPLAY '(1,1)                       : ' WS-SECOND(1,1).
002230     DISPLAY '(1,2)                       : ' WS-SECOND(1,2).
002300     DISPLAY ' SECOND ENTRY IN THE TABLE  : ' WS-FIRST(2).
002320     DISPLAY '(2,1)                       : ' WS-SECOND(2,1).
002330     DISPLAY '(2,2)                       : ' WS-SECOND(2,2).
002400     DISPLAY ' THIRD ENTRY IN THE TABLE   : ' WS-FIRST(3).
002420     DISPLAY '(3,1)                       : ' WS-SECOND(3,1).
002430     DISPLAY '(3,2)                       : ' WS-SECOND(3,2).
002500     STOP RUN.
