000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. HELLO.
000030 PROCEDURE DIVISION.
000040      DISPLAY 'Welcome to Tutorialspoint'.
000050      STOP RUN.
