000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PCOND.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-NUM1         PIC 9(2) VALUE 99.
000600 01 WS-NUM2         PIC 9(2) VALUE 72.
000700 01 WS-NUM3         PIC 9(2) VALUE 35.
000800 01 WS-NUM4         PIC 9(2) VALUE 35.
000900 01 WS-NUM5         PIC S9(2) VALUE -25.
001000 01 WS-NAME         PIC A(15) VALUE 'abcdef'.
001100 01 WS-MARKS        PIC 9(3).
001200    88 PASS VALUES ARE 041 THRU 100.
001300    88 FAIL VALUES ARE 000 THRU 040.
001400 PROCEDURE DIVISION.
001500     DISPLAY 'WS-NUM1 : ' WS-NUM1.
001600     DISPLAY 'WS-NUM2 : ' WS-NUM2.
001700     DISPLAY 'WS-NUM3 : ' WS-NUM3.
001800     DISPLAY 'WS-NUM4 : ' WS-NUM4.
001900     DISPLAY 'WS-NUM5 : ' WS-NUM5.
002000     IF WS-NUM1 > WS-NUM2 THEN
002100         DISPLAY 'WS-NUM1 IS GREATER'
002200         IF WS-NUM3 = WS-NUM4 THEN
002300             DISPLAY 'NUM3 AND NUM4 ARE EQUAL'
002400         END-IF
002500     ELSE
002600         DISPLAY 'WS-NUM2 IS GREATER'
002700     END-IF.
002800     IF WS-NUM5 IS NEGATIVE THEN
002900         DISPLAY 'WS-NUM5 IS NEGATIVE'
003000     END-IF.
003100     IF WS-NAME IS ALPHABETIC THEN
003200         DISPLAY 'WS-NAME IS ALPHABETIC'
003300     END-IF.
003400     IF WS-NUM1 IS NUMERIC THEN
003500         DISPLAY 'WS-NUM1 IS NUMERIC'
003600     END-IF.
003700     MOVE 75 TO WS-MARKS.
003800     IF PASS
003900         DISPLAY 'WS-MARKS : ' WS-MARKS ' PASS'
004000     END-IF.
004100     IF NOT FAIL
004200         DISPLAY 'WS-MARKS : ' WS-MARKS ' NEGATED – PASS'
004300     END-IF.
004400     EVALUATE TRUE
004500         WHEN WS-NUM4 > 10
004600            DISPLAY 'WS-NUM4 VALUE IS ' WS-NUM4 ' GREATER THAN 10'
004700         WHEN WS-NUM4 < 10
004800             DISPLAY 'WS-NUM4 ' WS-NUM4 ' LESS THAN 10'
004900         WHEN OTHER
005000             DISPLAY ' OTHER CONDITION'
005100     END-EVALUATE.
005200     STOP RUN.
