       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
       AUTHOR. SAMSON C.
       DATE-WRITTEN. 5/28/2025.
       DATE-COMPILED. 5/28/2025.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. MINT_LINUX_X64_22_1.
       OBJECT-COMPUTER. MINT_LINUX_X64_22_1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
           DISPLAY "Hello, World!, from GNU Cobol".
           DISPLAY "This is bonkers cool!".
           STOP RUN.
