000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PLOOP.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-CNT         PIC 9(1) VALUE 0.
000600 PROCEDURE DIVISION.
000700 A000-PARA.
000800     PERFORM 
000900         DISPLAY ' A000 INLINE PERFORM PARA'
001000     END-PERFORM.
001100     PERFORM C000-PARA THRU E000-PARA.
001200     PERFORM B000-PARA.
001300     PERFORM F000-PARA WITH TEST AFTER UNTIL WS-CNT = 3.
001400     PERFORM G000-PARA 3 TIMES.
001500     PERFORM H000-PARA VARYING WS-CNT FROM 1 BY 1 UNTIL WS-CNT = 7.
001600     STOP RUN.
001700 B000-PARA.
001800     DISPLAY ' B000 PERFORM PARA'.
001900 C000-PARA.
002000     DISPLAY ' C000 PERFORM PARA'.
002100 D000-PARA.
002200     DISPLAY ' D000 PERFORM PARA'.
002300 E000-PARA.
002400     DISPLAY ' E000 PERFORM PARA'.
002500 F000-PARA.
002600     DISPLAY ' ' WS-CNT ' ITERATION F PARA'.
002700     ADD 1 TO WS-CNT.
002800 G000-PARA.
002900     DISPLAY ' G000 PERFROM PARA'.
003000 H000-PARA.
003100     DISPLAY ' ' WS-CNT ' ITERATION H-PARA'.
