000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PSTRING.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-STRING      PIC A(15).
000600 01 WS-CNTA        PIC 99.
000700 01 WS-CNTS        PIC 99.
000800 PROCEDURE DIVISION.
000900     MOVE 'ABCDEASSDAERAAA' TO WS-STRING.
001000     INITIALIZE WS-CNTA.
001100     INSPECT WS-STRING TALLYING WS-CNTA FOR ALL 'A'.
001200     DISPLAY 'COUNT OF A IN STRING   : ' WS-CNTA.
001300     INSPECT WS-STRING REPLACING ALL 'A' BY 'X'.
001400     INITIALIZE WS-CNTA.
001500     INSPECT WS-STRING TALLYING WS-CNTA FOR ALL 'A'.
001600     DISPLAY 'WS-STRING              : ' WS-STRING.
001700     DISPLAY 'COUNT OF A IN STRING   : ' WS-CNTA.
001800     STOP RUN.
