000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PSTRING2.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-STRING      PIC A(40) VALUE SPACES.
000510 01 WS-STR1        PIC A(8) VALUE 'WELCOME '.
000520 01 WS-STR2        PIC A(3) VALUE 'TO '.
000530 01 WS-STR3        PIC A(16) VALUE 'TUTORIALSPOINT'.
000540 01 WS-USTR1       PIC A(8) VALUE SPACES.
000550 01 WS-USTR2       PIC A(3) VALUE SPACES.
000560 01 WS-USTR3       PIC A(16) VALUE SPACES.
000600 PROCEDURE DIVISION.
000900     DISPLAY ' STRING 1 : ' WS-STR1.
001000     DISPLAY ' STRING 2 : ' WS-STR2.
001100     DISPLAY ' STRING 3 : ' WS-STR3.
001200     STRING WS-STR1 DELIMITED BY SIZE
001300            WS-STR2 DELIMITED BY SIZE
001400            WS-STR3 DELIMITED BY SPACE
001500       INTO WS-STRING
001600     END-STRING.
001700     DISPLAY ' WS-STRING : ' WS-STRING.
001701*    GO TO A000-PARA.
001710     UNSTRING WS-STRING DELIMITED BY SPACE
001720       INTO WS-USTR1, WS-USTR2, WS-USTR3
001730     END-UNSTRING.
001740     DISPLAY ' UNSTRING 1 : ' WS-USTR1.
001750     DISPLAY ' UNSTRING 2 : ' WS-USTR2.
001760     DISPLAY ' UNSTRING 3 : ' WS-USTR3.
001800     STOP RUN.
002000 A000-PARA.
002100     DISPLAY ' BYPASSING UNSTRING STEP USING GO TO STATEMENT'.
002200     STOP RUN.
