000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PGM1.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-NUM1        PIC 9(2) VALUE 99.
000600 01 WS-NUM2        PIC 9(2) VALUE 72.
000700 01 WS-ADD         PIC 9(3).
000800 01 WS-PGM         PIC X(8).
000900 PROCEDURE DIVISION.
000905     DISPLAY ' IN CALLING MODULE'
000906     DISPLAY ' WS-NUM1 : ' WS-NUM1.
000907     DISPLAY ' WS-NUM2 : ' WS-NUM2.
000908     ADD WS-NUM1 TO WS-NUM2 GIVING WS-ADD.
000909     DISPLAY ' WS-ADD  : ' WS-ADD.
001000     MOVE 'PGM2' TO WS-PGM.
001001     CALL WS-PGM USING WS-NUM1, WS-NUM2.
001003*    CALL WS-PGM USING BY CONTENT WS-NUM1, WS-NUM2.
001004     DISPLAY ' IN CALLING MODULE'
001005     ADD WS-NUM1 TO WS-NUM2 GIVING WS-ADD.
001006     DISPLAY ' WS-NUM1 : ' WS-NUM1.
001007     DISPLAY ' WS-NUM2 : ' WS-NUM2.
001008     DISPLAY ' WS-ADD  : ' WS-ADD.
001009     STOP RUN.
