000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PGM2.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01 WS-MESSAGE     PIC X(10).
000600 LINKAGE SECTION.
000700 01 LS-NUM1        PIC 9(2).
000800 01 LS-NUM2        PIC 9(2).
001000 PROCEDURE DIVISION USING LS-NUM1, LS-NUM2.
001100     DISPLAY ' IN CALLED PROGRAM'.
001200     MOVE 79 TO LS-NUM1.
001300     MOVE 68 TO LS-NUM2.
001400     DISPLAY ' LS-NUM1 : ' LS-NUM1.
001500     DISPLAY ' LS-NUM2 : ' LS-NUM2.
004800     EXIT PROGRAM.
