000100*****************************************************************
000200* LEVEL NUMBER -
000300*     01 - RECORD DESCRIPTION ENTRY
000400*     02 TO 49 - GROUP AND ELEMENTARY ITEMS
000500*     66 - RENAME CLAUSE
000600*     77 - ITEMS CANNOT BE SUBDIVIDED
000700*     88 - CONDITION NAME ENTRY
000710*
000720* PICTURE CLAUSE
000730*    9 - NUMERIC
000740*    A - ALPHABETIC
000741*    X - ALPHANUMERIC
000742*    V - IMPLICIT DECIMAL
000743*    S - SIGN
000744*
002000*****************************************************************
002100 IDENTIFICATION DIVISION.
002200 PROGRAM-ID. HELLO.
002400 DATA DIVISION.
002500 WORKING-STORAGE SECTION.
002600 01 WS-CLASS           PIC 9(3)       VALUE 100.
002601 01 WS-MARKS           PIC S9(3)V9(2) VALUE -123.45.
002610 01 WS-ADDRESS.
002620    05 WS-HOUSE-NUMBER PIC 9(3).
002620    05 WS-STREET       PIC A(20).
002640    05 WS-CITY         PIC X(20)      VALUE 'XYZ'.
002700*****************************************************************
002800 PROCEDURE DIVISION.
002900      DISPLAY 'Hello, World!'.
003200      STOP RUN.
