000001******************************************************************
000010* AREA|                     AREA B                               |
000020*  A
000030*
000040* COMMENT LINE - THIS IS A COMMENT LINE.
000041*
000050* COMMENT ENTRY - ENTRIES INCLUDED IN OPTION PARAGRAPHS.
000051* 
000060* LITERAL - CONSTANT THAT IS HARDCODED IN THE PROGRAM.
000070*     ALPHANUMERIC
000080*     NUMERIC
000090*        VALID - 100 +10.79 -1.9
000091*        INVALID - 1,000 10. 10.9-
000092*
000093* RESERVED WORDS
000094*      KEYWORDS    ADD, ACCEPT, MOVE
000095*      SPECIAL CHARACTERS   + - * =
000096*      FIGURATIVE CONSTANTS  ZEROS, HIGH VALUES, LOW VALUES
000097*                            SPACES, QUOTES, ALL LITERAL
000098******************************************************************
000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. HELLO.
000300 AUTHOR. SAMSON CARTER.
001500 DATA DIVISION.
002100 WORKING-STORAGE SECTION.
002200 01 WS-CLASSS PIC 9(3) VALUE 100.
002900******************************************************************
003000 PROCEDURE DIVISION.
003100      DISPLAY 'Hello, World!'.
003210      DISPLAY 'THIS ISN''T INVALID'.
003220      DISPLAY 'THIS IS INVALID'. 
003300      STOP RUN.
