000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. PFILES.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT INFILE ASSIGN TO DDINPUT
000700         ORGANIZATION IS SEQUENTIAL.
000800 DATA DIVISION.
000900 FILE SECTION.
001000 FD INFILE.
001100 01 NAME PIC A(80).
001200 WORKING-STORAGE SECTION.
001300 01 WS-NAME     PIC A(80).
001400 01 WS-EOF      PIC A VALUE SPACE.
001500 PROCEDURE DIVISION.
001600     OPEN INPUT INFILE.
001700     PERFORM UNTIL WS-EOF = 'Y'
001800         READ INFILE INTO WS-NAME
001900             AT END MOVE 'Y' TO WS-EOF
002000             NOT AT END DISPLAY WS-NAME
002100         END-READ
002200     END-PERFORM.
002300     CLOSE INFILE.
002400     STOP RUN.
